 ## Import

In [1]:
import pandas as pd

## Concat()

Concatenating objects is appending data to the data-frame.

In [2]:
df1 = pd.DataFrame(
    {
        'f_name':['Homer', 'Otto', 'Rod'],
        'l_name':['Simpson', 'Mann', 'Flanders'],
        'occupation': ['Inspector', 'Bus Driver', 'Student'],
        'first_episode_apperance':['1', '3', '7'],
    })
 
    
df2 = pd.DataFrame(
    {
        'f_name':['Milhouse', 'Krusty'],
        'l_name':['Van Houten', 'The Clown'],
        'occupation': ['Student', 'Entertainer'],
        'first_episode_apperance':['1', '35'],
        'sex': ['M', 'M']
    })

In [3]:
df1

  f_name    l_name  occupation first_episode_apperance
0  Homer   Simpson   Inspector                       1
1   Otto      Mann  Bus Driver                       3
2    Rod  Flanders     Student                       7

In [4]:
df2

     f_name      l_name   occupation first_episode_apperance sex
0  Milhouse  Van Houten      Student                       1   M
1    Krusty   The Clown  Entertainer                      35   M

In [5]:
result = pd.concat([df1, df2], ignore_index=True)
result

     f_name      l_name   occupation first_episode_apperance  sex
0     Homer     Simpson    Inspector                       1  NaN
1      Otto        Mann   Bus Driver                       3  NaN
2       Rod    Flanders      Student                       7  NaN
3  Milhouse  Van Houten      Student                       1    M
4    Krusty   The Clown  Entertainer                      35    M

### Notes

Other Parameters:
______
axis: {0, 1}, default 0  
join : {'inner', 'outer'}, default 'outer'  
ignore_index : bool, default False

## Merge()

pandas.merge() allows us to join datasets based off similar columns.

In [6]:
df1 = pd.DataFrame({
                'name':['Luke', 'R2-D2', 'Obi-Wan', 'Yoda'],
                'species': ['Human', 'Droid', 'Human', 'Unknown']
                })


df2 = pd.DataFrame({
                'name':['Anakin','Luke', 'R2-D2', 'Obi-Wan', 'Yoda'],
                'originate': ['Tatooine','Tatooine', 'Nubia', 'Stewjon', 'Unknown']
                })

In [7]:
df1

      name  species
0     Luke    Human
1    R2-D2    Droid
2  Obi-Wan    Human
3     Yoda  Unknown

In [8]:
df2

      name originate
0   Anakin  Tatooine
1     Luke  Tatooine
2    R2-D2     Nubia
3  Obi-Wan   Stewjon
4     Yoda   Unknown

In [9]:
result = pd.merge(df1, df2, on=['name'])
result

      name  species originate
0     Luke    Human  Tatooine
1    R2-D2    Droid     Nubia
2  Obi-Wan    Human   Stewjon
3     Yoda  Unknown   Unknown

### Notes

Other Parameters:
______
how : {'inner', 'outer', 'left', 'right', 'cross'}, default 'inner'